[
  {
    "id": "5",
    "createdAt": "2025-09-05T00:00:00.000Z",
    "updatedAt": "2025-09-05T00:00:00.000Z",
    "title": "Present Perfect",
    "shortDescription": "Explore the Present Perfect tense and its uses.",
    "description": "The Present Perfect tense is a bridge between the past and the present. It's used to talk about actions that happened at an unspecified time in the past but have a connection to the present moment. It's formed with 'have' or 'has' and the past participle of the main verb. For instance, 'I have lost my keys' implies that the keys are still lost now. It is also used to talk about life experiences, as in 'She has traveled to Japan.' Mastering the Present Perfect allows for more nuanced conversations about how past events affect the present.",
    "content": "The Present Perfect connects the past and the present.",
    "level": "Intermediate",
    "duration": "30-45 minutes",
    "likes": 30,
    "userId": "user-5",
    "image": "/default.png"
  },
  {
    "id": "6",
    "createdAt": "2025-09-05T00:00:00.000Z",
    "updatedAt": "2025-09-05T00:00:00.000Z",
    "title": "Present Perfect Continuous",
    "shortDescription": "Understand the Present Perfect Continuous tense.",
    "description": "The Present Perfect Continuous tense is used for actions that started in the past and continue to the present, or have recently stopped. It emphasizes the duration of the action and is formed with have/has been + verb-ing.",
    "content": "Used for actions that started in the past and continue now.",
    "level": "Intermediate",
    "duration": "30-45 minutes",
    "likes": 12,
    "userId": "user-6",
    "image": "/default.png"
  },
  {
    "id": "7",
    "createdAt": "2025-09-05T00:00:00.000Z",
    "updatedAt": "2025-09-05T00:00:00.000Z",
    "title": "Past Perfect",
    "shortDescription": "Learn how to use the Past Perfect tense.",
    "description": "The Past Perfect tense is used to show that one action was completed before another action in the past. It is formed with had + past participle and helps establish a clear sequence of past events.",
    "content": "The Past Perfect is used for actions completed before another past action.",
    "level": "Intermediate",
    "duration": "30-45 minutes",
    "likes": 14,
    "userId": "user-7",
    "image": "/default.png"
  },
  {
    "id": "8",
    "createdAt": "2025-09-05T00:00:00.000Z",
    "updatedAt": "2025-09-05T00:00:00.000Z",
    "title": "Past Perfect Continuous",
    "shortDescription": "Master the Past Perfect Continuous tense.",
    "description": "The Past Perfect Continuous tense is used to talk about an ongoing action in the past that continued up until another past event. It focuses on the duration of the first action. It's formed with 'had been' and the '-ing' form of the verb. For example, 'She had been studying for hours before she finally took a break.' This tense is excellent for showing cause and effect in the past and for adding depth to your descriptions of past situations by emphasizing how long they lasted.",
    "content": "Used for actions that were ongoing up to a point in the past.",
    "level": "Intermediate",
    "duration": "30-45 minutes",
    "likes": 10,
    "userId": "user-8",
    "image": "/default.png"
  },
  {
    "id": "9",
    "createdAt": "2025-09-05T00:00:00.000Z",
    "updatedAt": "2025-09-05T00:00:00.000Z",
    "title": "Future Simple",
    "shortDescription": "Learn how to talk about the future using Future Simple.",
    "description": "The Future Simple tense is used to talk about things that we believe will happen in the future or to make spontaneous decisions. It is most commonly formed with the modal verb 'will' followed by the base form of the main verb. For example, 'I think it will rain tomorrow' is a prediction, while 'I'll have the salad' is a decision made at the moment of speaking. The Future Simple is a straightforward way to express future intentions, predictions, and promises.",
    "content": "The Future Simple is used for predictions and decisions made at the moment.",
    "level": "Basic",
    "duration": "30-45 minutes",
    "likes": 19,
    "userId": "user-9",
    "image": "/default.png"
  },
  {
    "id": "10",
    "createdAt": "2025-09-05T00:00:00.000Z",
    "updatedAt": "2025-09-05T00:00:00.000Z",
    "title": "Future Continuous",
    "shortDescription": "Understand the Future Continuous tense.",
    "description": "The Future Continuous tense describes an ongoing action that will be in progress at a specific time in the future. It helps to paint a picture of what will be happening at a particular future moment. It's formed with 'will be' and the '-ing' form of the verb. For example, 'This time next week, I will be relaxing on a beach.' It can also be used to ask politely about someone's plans: 'Will you be going to the party tonight?' This tense adds a sense of vividness to future descriptions.",
    "content": "Used for actions that will be ongoing at a specific time in the future.",
    "level": "Intermediate",
    "duration": "30-45 minutes",
    "likes": 11,
    "userId": "user-10",
    "image": "/default.png"
  },
  {
    "id": "11",
    "createdAt": "2025-09-05T00:00:00.000Z",
    "updatedAt": "2025-09-05T00:00:00.000Z",
    "title": "Future Perfect",
    "shortDescription": "Learn the Future Perfect tense.",
    "description": "The Future Perfect tense is used to express an action that will be completed before a specific point in the future. It looks back from a future time to an earlier event. It is formed with 'will have' and the past participle of the verb. For example, 'By 2030, they will have finished building the bridge.' This tense is useful for setting deadlines and talking about accomplishments that are expected to be finalized by a certain future time, providing a clear endpoint for future actions.",
    "content": "Used for actions that will be completed before a certain future time.",
    "level": "Intermediate",
    "duration": "30-45 minutes",
    "likes": 13,
    "userId": "user-11",
    "image": "/default.png"
  },
  {
    "id": "12",
    "createdAt": "2025-09-05T00:00:00.000Z",
    "updatedAt": "2025-09-05T00:00:00.000Z",
    "title": "Future Perfect Continuous",
    "shortDescription": "Master the Future Perfect Continuous tense.",
    "description": "The Future Perfect Continuous tense is used to emphasize the duration of an action up to a specific point in the future. It describes how long an action will have been happening by a certain future time. It's formed with 'will have been' and the '-ing' form of the verb. For example, 'In April, she will have been working here for ten years.' This advanced tense is perfect for situations where the length of a future ongoing activity is the main point of focus.",
    "content": "Used for actions that will be ongoing up to a point in the future.",
    "level": "Advanced",
    "duration": "30-45 minutes",
    "likes": 7,
    "userId": "user-12",
    "image": "/default.png"
  },
  {
    "id": "13",
    "createdAt": "2025-09-05T00:00:00.000Z",
    "updatedAt": "2025-09-05T00:00:00.000Z",
    "title": "Modal Verbs",
    "shortDescription": "Learn about modal verbs and their uses.",
    "description": "Modal verbs are special auxiliary verbs that express concepts such as ability, permission, obligation, possibility, and advice. Common modal verbs include 'can', 'could', 'may', 'might', 'must', 'shall', 'should', 'will', and 'would'. They are different from normal verbs because they don't change form for person or tense. For example, 'She can swim' (ability) or 'You must finish your homework' (obligation). Understanding modal verbs is essential for expressing nuanced meanings and social functions in communication.",
    "content": "Modal verbs express ability, possibility, permission, or obligation.",
    "level": "Basic",
    "duration": "30-45 minutes",
    "likes": 21,
    "userId": "user-13",
    "image": "/default.png"
  },
  {
    "id": "14",
    "createdAt": "2025-09-05T00:00:00.000Z",
    "updatedAt": "2025-09-05T00:00:00.000Z",
    "title": "Passive Voice",
    "shortDescription": "Understand how to use the passive voice.",
    "description": "The passive voice is a grammatical construction where the subject of the sentence receives the action of the verb, rather than performing it. The focus shifts from the doer of the action to the action itself or the recipient. It is formed using the verb 'to be' and the past participle of the main verb. For example, in 'The ball was thrown by the boy,' the focus is on the ball. The passive voice is often used in formal and scientific writing, or when the agent is unknown or unimportant.",
    "content": "The passive voice is used when the focus is on the action, not the subject.",
    "level": "Intermediate",
    "duration": "30-45 minutes",
    "likes": 17,
    "userId": "user-14",
    "image": "/default.png"
  },
  {
    "id": "15",
    "createdAt": "2025-09-05T00:00:00.000Z",
    "updatedAt": "2025-09-05T00:00:00.000Z",
    "title": "Conditionals",
    "shortDescription": "Explore the different types of conditional sentences.",
    "description": "Conditional sentences, also known as 'if clauses,' are used to talk about hypothetical situations and their consequences. There are several types, including the zero conditional (for general truths), the first conditional (for real future possibilities), the second conditional (for unreal present or future situations), and the third conditional (for unreal past situations). For example, 'If you heat water, it boils' (zero) vs. 'If I had known, I would have helped' (third). Mastering conditionals allows you to express a wide range of hypothetical scenarios.",
    "content": "Conditionals are used to talk about possible or imaginary situations.",
    "level": "Intermediate",
    "duration": "30-45 minutes",
    "likes": 20,
    "userId": "user-15",
    "image": "/default.png"
  },
  {
    "id": "16",
    "createdAt": "2025-09-05T00:00:00.000Z",
    "updatedAt": "2025-09-05T00:00:00.000Z",
    "title": "Reported Speech",
    "shortDescription": "Learn how to use reported speech.",
    "description": "Reported speech, or indirect speech, is how we report what someone else has said without using their exact words. This often involves changes in tense, pronouns, and time/place adverbs. For example, the direct speech 'I am happy' becomes 'She said that she was happy' in reported speech. Learning the rules of reported speech is crucial for recounting conversations and integrating others' statements into your own narrative smoothly and accurately.",
    "content": "Reported speech is used to tell what someone else said.",
    "level": "Intermediate",
    "duration": "30-45 minutes",
    "likes": 16,
    "userId": "user-16",
    "image": "/default.png"
  },
  {
    "id": "17",
    "createdAt": "2025-09-05T00:00:00.000Z",
    "updatedAt": "2025-09-05T00:00:00.000Z",
    "title": "Questions",
    "shortDescription": "Master forming questions in English.",
    "description": "Forming questions correctly is a fundamental skill for communication. There are several types of questions in English, including 'yes/no' questions (e.g., 'Are you coming?'), 'wh-' questions that start with words like who, what, where, when, why, and how (e.g., 'Where do you live?'), and tag questions which are added to the end of a statement (e.g., 'It's a nice day, isn't it?'). Understanding the structure for each type will enable you to seek information effectively and engage in dynamic conversations.",
    "content": "Learn about yes/no questions, wh-questions, and question tags.",
    "level": "Basic",
    "duration": "30-45 minutes",
    "likes": 23,
    "userId": "user-17",
    "image": "/default.png"
  },
  {
    "id": "18",
    "createdAt": "2025-09-05T00:00:00.000Z",
    "updatedAt": "2025-09-05T00:00:00.000Z",
    "title": "Negatives",
    "shortDescription": "Learn how to form negative sentences.",
    "description": "Forming negative sentences is essential for expressing denial, refusal, or the absence of something. In English, negatives are typically formed by adding 'not' after an auxiliary verb (like 'be', 'do', 'have') or a modal verb. For example, 'He is not here' or 'I do not like spinach.' Other negative words like 'never', 'no', 'nobody', and 'nothing' can also be used to create negative meaning. Correctly constructing negative sentences is key to clear and accurate communication.",
    "content": "Negatives are formed using not, never, nobody, etc.",
    "level": "Basic",
    "duration": "30-45 minutes",
    "likes": 14,
    "userId": "user-18",
    "image": "/default.png"
  },
  {
    "id": "19",
    "createdAt": "2025-09-05T00:00:00.000Z",
    "updatedAt": "2025-09-05T00:00:00.000Z",
    "title": "Articles",
    "shortDescription": "Understand the use of a, an, and the.",
    "description": "Articles are small but powerful words that specify whether a noun is general or specific. 'A' and 'an' are indefinite articles used for non-specific nouns (e.g., 'a book'), while 'the' is the definite article used for specific nouns (e.g., 'the book on the table'). The choice between 'a' and 'an' depends on the sound of the following word. Mastering articles is one of the trickiest parts of learning English, but it is crucial for sounding natural and being understood correctly.",
    "content": "Articles are used to define nouns as specific or unspecific.",
    "level": "Basic",
    "duration": "30-45 minutes",
    "likes": 27,
    "userId": "user-19",
    "image": "/default.png"
  },
  {
    "id": "20",
    "createdAt": "2025-09-05T00:00:00.000Z",
    "updatedAt": "2025-09-05T00:00:00.000Z",
    "title": "Prepositions",
    "shortDescription": "Learn about prepositions of time, place, and movement.",
    "description": "Prepositions are words like 'in', 'on', 'at', 'from', and 'to' that show the relationship between a noun or pronoun and other words in a sentence. They can indicate time ('at 5 PM'), place ('in the box'), and direction or movement ('to the store'). Prepositions are often tricky because their usage can be idiomatic and depends on context. A good understanding of prepositions is vital for constructing coherent sentences and expressing relationships between ideas, objects, and locations.",
    "content": "Prepositions show relationships between nouns and other words.",
    "level": "Basic",
    "duration": "30-45 minutes",
    "likes": 22,
    "userId": "user-20",
    "image": "/default.png"
  },
  {
    "id": "21",
    "createdAt": "2025-09-05T00:00:00.000Z",
    "updatedAt": "2025-09-05T00:00:00.000Z",
    "title": "Relative Clauses",
    "shortDescription": "Master the use of relative clauses.",
    "description": "Relative clauses are used to add extra information about a noun in the main clause without starting a new sentence. They are introduced by relative pronouns like 'who', 'whom', 'whose', 'which', and 'that'. For example, in 'The man who lives next door is a doctor,' the relative clause 'who lives next door' identifies which man we are talking about. There are defining and non-defining relative clauses, and knowing the difference is key to providing either essential or additional information gracefully.",
    "content": "Relative clauses give more information about a noun.",
    "level": "Intermediate",
    "duration": "30-45 minutes",
    "likes": 12,
    "userId": "user-21",
    "image": "/default.png"
  },
  {
    "id": "22",
    "createdAt": "2025-09-05T00:00:00.000Z",
    "updatedAt": "2025-09-05T00:00:00.000Z",
    "title": "Comparatives and Superlatives",
    "shortDescription": "Learn how to compare things using adjectives and adverbs.",
    "description": "Comparatives and superlatives are forms of adjectives and adverbs used to compare two or more things. Comparatives often end in '-er' or use 'more', while superlatives often end in '-est' or use 'most'. For example, 'bigger' (comparative) and 'biggest' (superlative). 'She is more intelligent than her brother' is a comparative sentence, while 'He is the most intelligent in the class' is superlative. Mastery of comparatives and superlatives enables you to describe differences and extremes effectively.",
    "content": "Comparatives and superlatives help compare qualities of things.",
    "level": "Basic",
    "duration": "30-45 minutes",
    "likes": 18,
    "userId": "user-22",
    "image": "/default.png"
  },
  {
    "id": "23",
    "createdAt": "2025-09-05T00:00:00.000Z",
    "updatedAt": "2025-09-05T00:00:00.000Z",
    "title": "Quantifiers",
    "shortDescription": "Understand words like some, any, much, many, a lot of.",
    "description": "Quantifiers are words that express quantity or amount. They include words like 'some', 'any', 'much', 'many', 'a lot of', 'few', and 'several'. They are used before nouns to indicate how much or how many. For example, 'There are many books on the shelf' vs. 'There isn't much time left.' Quantifiers are crucial for both everyday conversation and formal communication as they help specify amounts clearly and naturally.",
    "content": "Quantifiers show how much or how many of something there is.",
    "level": "Basic",
    "duration": "30-45 minutes",
    "likes": 15,
    "userId": "user-23",
    "image": "/default.png"
  },
  {
    "id": "24",
    "createdAt": "2025-09-05T00:00:00.000Z",
    "updatedAt": "2025-09-05T00:00:00.000Z",
    "title": "Gerunds and Infinitives",
    "shortDescription": "Learn when to use verb + ing and to + verb.",
    "description": "Gerunds (verb + ing) and infinitives (to + verb) are verb forms used in different contexts. Some verbs are followed by gerunds (e.g., 'I enjoy reading'), while others are followed by infinitives (e.g., 'I want to read'). Some verbs can take both, but with a difference in meaning (e.g., 'I stopped smoking' vs. 'I stopped to smoke'). Understanding when to use gerunds and infinitives is essential for fluency and accuracy in English grammar.",
    "content": "Gerunds and infinitives are verb forms used after other verbs.",
    "level": "Intermediate",
    "duration": "30-45 minutes",
    "likes": 19,
    "userId": "user-24",
    "image": "/default.png"
  },
  {
    "id": "25",
    "createdAt": "2025-09-05T00:00:00.000Z",
    "updatedAt": "2025-09-05T00:00:00.000Z",
    "title": "Phrasal Verbs",
    "shortDescription": "Understand phrasal verbs and their meanings.",
    "description": "Phrasal verbs are combinations of verbs with prepositions or adverbs that create new meanings. For example, 'give up' means 'to quit', and 'look after' means 'to take care of'. They are very common in spoken English and often cannot be understood literally. Learning phrasal verbs is challenging but essential for sounding natural in English, as they are deeply embedded in everyday conversation and informal writing.",
    "content": "Phrasal verbs are verb + preposition/adverb combinations with new meanings.",
    "level": "Intermediate",
    "duration": "30-45 minutes",
    "likes": 24,
    "userId": "user-25",
    "image": "/default.png"
  },
  {
    "id": "26",
    "createdAt": "2025-09-05T00:00:00.000Z",
    "updatedAt": "2025-09-05T00:00:00.000Z",
    "title": "Collocations",
    "shortDescription": "Learn about word combinations that sound natural.",
    "description": "Collocations are natural word combinations that native speakers commonly use, such as 'make a decision', 'do homework', or 'strong coffee'. They can be verb + noun, adjective + noun, or other common pairings. Using correct collocations is key to sounding fluent and natural in English, as incorrect combinations may sound strange even if grammatically correct. Studying collocations helps learners internalize patterns of natural usage and avoid awkward expressions.",
    "content": "Collocations are words that naturally go together in English.",
    "level": "Intermediate",
    "duration": "30-45 minutes",
    "likes": 12,
    "userId": "user-26",
    "image": "/default.png"
  },
  {
    "id": "27",
    "createdAt": "2025-09-05T00:00:00.000Z",
    "updatedAt": "2025-09-05T00:00:00.000Z",
    "title": "Idioms",
    "shortDescription": "Discover common English idioms.",
    "description": "Idioms are expressions whose meanings are not literal but figurative, such as 'kick the bucket' (to die) or 'spill the beans' (to reveal a secret). Idioms are deeply tied to culture and are commonly used in spoken English and informal writing. Learning idioms is important for understanding movies, books, and conversations with native speakers. Mastery of idioms helps learners not only understand but also participate in richer, more natural communication.",
    "content": "Idioms are expressions with figurative meanings, not literal ones.",
    "level": "Intermediate",
    "duration": "30-45 minutes",
    "likes": 20,
    "userId": "user-27",
    "image": "/default.png"
  },
  {
    "id": "28",
    "createdAt": "2025-09-05T00:00:00.000Z",
    "updatedAt": "2025-09-05T00:00:00.000Z",
    "title": "Synonyms and Antonyms",
    "shortDescription": "Learn about synonyms and antonyms to expand vocabulary.",
    "description": "Synonyms are words with similar meanings (e.g., 'big' and 'large'), while antonyms are words with opposite meanings (e.g., 'hot' and 'cold'). Knowing a range of synonyms and antonyms helps to enrich vocabulary, avoid repetition, and express ideas more precisely. This skill is especially valuable for writing, as it allows for variety and nuance. It also improves reading comprehension by allowing learners to infer meanings from context.",
    "content": "Synonyms have similar meanings, antonyms have opposite meanings.",
    "level": "Basic",
    "duration": "30-45 minutes",
    "likes": 15,
    "userId": "user-28",
    "image": "/default.png"
  },
  {
    "id": "29",
    "createdAt": "2025-09-05T00:00:00.000Z",
    "updatedAt": "2025-09-05T00:00:00.000Z",
    "title": "Prefixes and Suffixes",
    "shortDescription": "Understand how prefixes and suffixes change word meanings.",
    "description": "Prefixes and suffixes are added to the beginning or end of words to change their meaning or form. For example, 'un-' in 'unhappy' makes it negative, while '-ness' in 'happiness' turns the adjective into a noun. Understanding prefixes and suffixes helps learners decode unfamiliar words, expand their vocabulary, and improve spelling. It's a powerful strategy for building confidence in both reading and writing.",
    "content": "Prefixes and suffixes are word parts that modify meanings.",
    "level": "Basic",
    "duration": "30-45 minutes",
    "likes": 11,
    "userId": "user-29",
    "image": "/default.png"
  },
  {
    "id": "30",
    "createdAt": "2025-09-05T00:00:00.000Z",
    "updatedAt": "2025-09-05T00:00:00.000Z",
    "title": "Word Order",
    "shortDescription": "Master the correct word order in sentences.",
    "description": "Word order in English typically follows a Subject-Verb-Object pattern, but it can vary depending on questions, negatives, and emphasis. For example, 'She eats an apple' (SVO) is standard. In questions, the order changes: 'Does she eat an apple?' Word order is essential for clarity and correct meaning, and mistakes can lead to confusion. Mastering it will significantly improve both written and spoken English.",
    "content": "Word order is crucial for clear communication in English.",
    "level": "Basic",
    "duration": "30-45 minutes",
    "likes": 26,
    "userId": "user-30",
    "image": "/default.png"
  }
]
